###################################################################

# Created by write_sdc on Mon Dec 26 17:48:13 2016

###################################################################
set sdc_version 1.9

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_fanout 50 [current_design]
set_max_fanout 50 [get_ports RST_N]
set_max_fanout 50 [get_ports PLL_CLOCK]
set_max_fanout 50 [get_ports ENA_RECOGNIZE]
set_max_fanout 50 [get_ports SRAM_DQ0]
set_max_fanout 50 [get_ports SRAM_DQ1]
set_max_fanout 50 [get_ports SRAM_DQ2]
set_max_fanout 50 [get_ports SRAM_DQ3]
set_max_fanout 50 [get_ports SRAM_DQ4]
set_max_fanout 50 [get_ports SRAM_DQ5]
set_max_fanout 50 [get_ports SRAM_DQ6]
set_max_fanout 50 [get_ports SRAM_DQ7]
set_max_fanout 50 [get_ports SRAM_DQ8]
set_max_fanout 50 [get_ports SRAM_DQ9]
set_max_fanout 50 [get_ports SRAM_DQ10]
set_max_fanout 50 [get_ports SRAM_DQ11]
set_max_fanout 50 [get_ports SRAM_DQ12]
set_max_fanout 50 [get_ports SRAM_DQ13]
set_max_fanout 50 [get_ports SRAM_DQ14]
set_max_fanout 50 [get_ports SRAM_DQ15]
set_max_fanout 50 [get_ports SRAM_DQ16]
set_max_fanout 50 [get_ports SRAM_DQ17]
set_max_fanout 50 [get_ports SRAM_DQ18]
set_max_fanout 50 [get_ports SRAM_DQ19]
set_max_fanout 50 [get_ports SRAM_DQ20]
set_max_fanout 50 [get_ports SRAM_DQ21]
set_max_fanout 50 [get_ports SRAM_DQ22]
set_max_fanout 50 [get_ports SRAM_DQ23]
set_max_fanout 50 [get_ports SRAM_DQ24]
set_max_fanout 50 [get_ports SRAM_DQ25]
set_max_fanout 50 [get_ports SRAM_DQ26]
set_max_fanout 50 [get_ports SRAM_DQ27]
set_max_fanout 50 [get_ports SRAM_DQ28]
set_max_fanout 50 [get_ports SRAM_DQ29]
set_max_fanout 50 [get_ports SRAM_DQ30]
set_max_fanout 50 [get_ports SRAM_DQ31]
set_ideal_network [get_ports RST_N]
create_clock [get_ports PLL_CLOCK]  -name CLOCK_SYS  -period 100  -waveform {0 50}
set_clock_latency 0.1  [get_clocks CLOCK_SYS]
set_clock_uncertainty 0.1  [get_clocks CLOCK_SYS]
set_clock_transition -max -rise 0.1 [get_clocks CLOCK_SYS]
set_clock_transition -max -fall 0.1 [get_clocks CLOCK_SYS]
set_clock_transition -min -rise 0.1 [get_clocks CLOCK_SYS]
set_clock_transition -min -fall 0.1 [get_clocks CLOCK_SYS]
group_path -name FEEDTHROUGH  -from [list [get_ports RST_N] [get_ports ENA_RECOGNIZE] [get_ports SRAM_DQ0] [get_ports SRAM_DQ1] [get_ports SRAM_DQ2] [get_ports SRAM_DQ3] [get_ports SRAM_DQ4] [get_ports SRAM_DQ5] [get_ports SRAM_DQ6] [get_ports SRAM_DQ7] [get_ports SRAM_DQ8] [get_ports SRAM_DQ9] [get_ports SRAM_DQ10] [get_ports SRAM_DQ11] [get_ports SRAM_DQ12] [get_ports SRAM_DQ13] [get_ports SRAM_DQ14] [get_ports SRAM_DQ15] [get_ports SRAM_DQ16] [get_ports SRAM_DQ17] [get_ports SRAM_DQ18] [get_ports SRAM_DQ19] [get_ports SRAM_DQ20] [get_ports SRAM_DQ21] [get_ports SRAM_DQ22] [get_ports SRAM_DQ23] [get_ports SRAM_DQ24] [get_ports SRAM_DQ25] [get_ports SRAM_DQ26] [get_ports SRAM_DQ27] [get_ports SRAM_DQ28] [get_ports SRAM_DQ29] [get_ports SRAM_DQ30] [get_ports SRAM_DQ31]]  -to [list [get_ports SRAM_ADDR0] [get_ports SRAM_ADDR1] [get_ports SRAM_ADDR2] [get_ports SRAM_ADDR3] [get_ports SRAM_ADDR4] [get_ports SRAM_ADDR5] [get_ports SRAM_ADDR6] [get_ports SRAM_ADDR7] [get_ports SRAM_ADDR8] [get_ports SRAM_ADDR9] [get_ports SRAM_ADDR10] [get_ports SRAM_ADDR11] [get_ports SRAM_ADDR12] [get_ports SRAM_ADDR13] [get_ports SRAM_ADDR14] [get_ports SRAM_ADDR15] [get_ports SRAM_ADDR16] [get_ports SRAM_ADDR17] [get_ports SRAM_ADDR18] [get_ports SRAM_ADDR19] [get_ports ENA_CHECKER]]
group_path -name REGIN  -from [list [get_ports RST_N] [get_ports ENA_RECOGNIZE] [get_ports SRAM_DQ0] [get_ports SRAM_DQ1] [get_ports SRAM_DQ2] [get_ports SRAM_DQ3] [get_ports SRAM_DQ4] [get_ports SRAM_DQ5] [get_ports SRAM_DQ6] [get_ports SRAM_DQ7] [get_ports SRAM_DQ8] [get_ports SRAM_DQ9] [get_ports SRAM_DQ10] [get_ports SRAM_DQ11] [get_ports SRAM_DQ12] [get_ports SRAM_DQ13] [get_ports SRAM_DQ14] [get_ports SRAM_DQ15] [get_ports SRAM_DQ16] [get_ports SRAM_DQ17] [get_ports SRAM_DQ18] [get_ports SRAM_DQ19] [get_ports SRAM_DQ20] [get_ports SRAM_DQ21] [get_ports SRAM_DQ22] [get_ports SRAM_DQ23] [get_ports SRAM_DQ24] [get_ports SRAM_DQ25] [get_ports SRAM_DQ26] [get_ports SRAM_DQ27] [get_ports SRAM_DQ28] [get_ports SRAM_DQ29] [get_ports SRAM_DQ30] [get_ports SRAM_DQ31]]
group_path -name REGOUT  -to [list [get_ports SRAM_ADDR0] [get_ports SRAM_ADDR1] [get_ports SRAM_ADDR2] [get_ports SRAM_ADDR3] [get_ports SRAM_ADDR4] [get_ports SRAM_ADDR5] [get_ports SRAM_ADDR6] [get_ports SRAM_ADDR7] [get_ports SRAM_ADDR8] [get_ports SRAM_ADDR9] [get_ports SRAM_ADDR10] [get_ports SRAM_ADDR11] [get_ports SRAM_ADDR12] [get_ports SRAM_ADDR13] [get_ports SRAM_ADDR14] [get_ports SRAM_ADDR15] [get_ports SRAM_ADDR16] [get_ports SRAM_ADDR17] [get_ports SRAM_ADDR18] [get_ports SRAM_ADDR19] [get_ports ENA_CHECKER]]
set_input_delay -clock CLOCK_SYS  1  [get_ports PLL_CLOCK]
set_input_delay -clock CLOCK_SYS  1  [get_ports RST_N]
set_input_delay -clock CLOCK_SYS  1  [get_ports ENA_RECOGNIZE]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ0]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ1]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ2]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ3]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ4]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ5]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ6]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ7]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ8]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ9]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ10]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ11]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ12]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ13]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ14]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ15]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ16]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ17]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ18]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ19]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ20]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ21]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ22]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ23]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ24]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ25]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ26]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ27]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ28]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ29]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ30]
set_input_delay -clock CLOCK_SYS  1  [get_ports SRAM_DQ31]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR0]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR1]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR2]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR3]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR4]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR5]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR6]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR7]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR8]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR9]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR10]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR11]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR12]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR13]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR14]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR15]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR16]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR17]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR18]
set_output_delay -clock CLOCK_SYS  1  [get_ports SRAM_ADDR19]
set_output_delay -clock CLOCK_SYS  1  [get_ports ENA_CHECKER]
